#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/tradejournalv2/tradejournal/runs/run-Mht7eRso52ynd6Je

Waiting for the plan to start...

Terraform v1.14.4
on linux_amd64
Initializing plugins and modules...
random_password.app_secret: Refreshing state... [id=none]
data.oci_objectstorage_namespace.ns: Refreshing...
oci_identity_dynamic_group.functions_dynamic_group: Refreshing state... [id=ocid1.dynamicgroup.oc1..aaaaaaaah6j7m2u524sutqhqulyralmzui4t5r2x52zsoz254nv6svhwab5a]
oci_core_vcn.trade_journal_vcn: Refreshing state... [id=ocid1.vcn.oc1.us-sanjose-1.amaaaaaaua5mxnqag6ixy3shc4jw5ewvakumwrx7kt5sytwan3zf2pder4rq]
data.oci_core_services.all_oci_services: Refreshing...
oci_kms_vault.trade_journal_vault: Refreshing state... [id=ocid1.vault.oc1.us-sanjose-1.gruyxinqaaaca.abzwuljrff5ykch556nt36xjgksl56mdzvuyqdgk2ciy3nqehbfiht7ikhaq]
data.oci_objectstorage_namespace.ns: Refresh complete after 1s [id=ObjectStorageNamespaceDataSource-2860814437]
oci_objectstorage_bucket.reports_storage: Refreshing state... [id=n/axtahv0mhabt/b/trade-journal-reports]
oci_objectstorage_bucket.trade_journal_storage: Refreshing state... [id=n/axtahv0mhabt/b/trade-journal-storage]
data.oci_core_services.all_oci_services: Refresh complete after 1s [id=CoreServicesDataSource-0]
oci_core_internet_gateway.trade_journal_igw: Refreshing state... [id=ocid1.internetgateway.oc1.us-sanjose-1.aaaaaaaaviontx4nunyjsn5tne6a67dkmmqdrhglmvftv7utbsgmitvwha3q]
oci_core_nat_gateway.trade_journal_nat: Refreshing state... [id=ocid1.natgateway.oc1.us-sanjose-1.aaaaaaaajxnddm7tvcle6jwn72pnnfz6ifrw726si5fwg5djchdotcrgyvpq]
oci_core_service_gateway.trade_journal_sg: Refreshing state... [id=ocid1.servicegateway.oc1.us-sanjose-1.aaaaaaaavkymgdfgrhsrk2ussqfgnqiuq63zcha75tyhn2ofpalzehturxya]
oci_core_security_list.functions_security_list: Refreshing state... [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaaknspaq756htv5s5pfvf3n6h5mcnx3rj6zh7qdbglupibmq235iva]
oci_core_security_list.public_security_list: Refreshing state... [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaatwbgowv6a523rb6ekzyxqu3fuyp2w3qtkd67woied34igtafqqrq]
oci_identity_policy.functions_secrets_policy: Refreshing state... [id=ocid1.policy.oc1..aaaaaaaatxmvecdo6aspnhoyhrqmdrl7z5x7vi73tai5nolcwlxah4hmdtha]
oci_identity_policy.functions_invoke_policy: Refreshing state... [id=ocid1.policy.oc1..aaaaaaaae74pjlio4d5ypom3qf76mzl4meb7wwpbojc4fq3s4mqjthlhpbsa]
oci_identity_policy.functions_network_policy: Refreshing state... [id=ocid1.policy.oc1..aaaaaaaaqjisndxbegr4nki7kyxc7ennkg4xwlk5m72x562ie2n3rjoelw6q]
oci_identity_policy.functions_object_storage_policy: Refreshing state... [id=ocid1.policy.oc1..aaaaaaaaz2w6f7mvaqfhdnscml6oqugqhhy4duxbbsvcmbxqplmpd66257na]
oci_identity_policy.functions_logging_policy: Refreshing state... [id=ocid1.policy.oc1..aaaaaaaa44zrftr5jwv75lr677dzkv4qkfpijx4q236ylzju3kovt3dzrr7q]
oci_identity_policy.functions_database_policy: Refreshing state... [id=ocid1.policy.oc1..aaaaaaaaty37dn3xfaexjlpbg6eswel2k55sadh6qdtjqidm6oxbz55s27ga]
oci_kms_key.trade_journal_key: Refreshing state... [id=ocid1.key.oc1.us-sanjose-1.gruyxinqaaaca.abzwuljr26nmrmp6fxdce2wawbv4f4hayu4ilhqngh72v4h35anzngjo6a3q]
oci_core_route_table.public_route_table: Refreshing state... [id=ocid1.routetable.oc1.us-sanjose-1.aaaaaaaaukx4srdmovtithbrm5xjnsux6ny5hwvsq5xqbx4yqa2pgqqjja3q]
oci_core_subnet.public_subnet: Refreshing state... [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaa4wpindu4n7aofhc4qitq5y2kt4aevtu7yfeaqwpzmwzh2lqgxwwa]
oci_apigateway_gateway.trade_journal_gateway: Refreshing state... [id=ocid1.apigateway.oc1.us-sanjose-1.amaaaaaaua5mxnqagsr5rtjmkzflmibqombjgsv2ep5zilfp6gsg656b4b3a]
oci_vault_secret.db_wallet_password: Refreshing state... [id=ocid1.vaultsecret.oc1.us-sanjose-1.amaaaaaaua5mxnqah526ump4gpww3woh4kfccoz7cz7zly3xew4ccejbqczq]
oci_vault_secret.app_secret: Refreshing state... [id=ocid1.vaultsecret.oc1.us-sanjose-1.amaaaaaaua5mxnqakv4efbdtwjnrrqyu34zvntegczjh7ndue4kkludyqfaa]
oci_vault_secret.db_admin_password: Refreshing state... [id=ocid1.vaultsecret.oc1.us-sanjose-1.amaaaaaaua5mxnqanimpyyxk346xcoemhsgw7bnqj42ckdifemeporl7iofq]
oci_core_route_table.private_route_table: Refreshing state... [id=ocid1.routetable.oc1.us-sanjose-1.aaaaaaaas2wsgxud2nkpujmtpubfs27kzswi3xc6fyyd74naaazv5dcmuydq]
oci_core_subnet.functions_subnet: Refreshing state... [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaady665tq6nw3ikw43my6ylw6y7gck733zlbpsoodm7ereqltdryma]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_apigateway_deployment.trade_journal_deployment will be created
  + resource "oci_apigateway_deployment" "trade_journal_deployment" {
      + compartment_id    = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + defined_tags      = (known after apply)
      + display_name      = "trade-journal-deployment"
      + endpoint          = (known after apply)
      + freeform_tags     = (known after apply)
      + gateway_id        = "ocid1.apigateway.oc1.us-sanjose-1.amaaaaaaua5mxnqagsr5rtjmkzflmibqombjgsv2ep5zilfp6gsg656b4b3a"
      + id                = (known after apply)
      + lifecycle_details = (known after apply)
      + path_prefix       = "/api/v1"
      + state             = (known after apply)
      + time_created      = (known after apply)
      + time_updated      = (known after apply)

      + specification {
          + logging_policies {
              + access_log {
                  + is_enabled = true
                }
              + execution_log {
                  + is_enabled = true
                  + log_level  = "INFO"
                }
            }
          + request_policies {
              + cors {
                  + allowed_headers              = [
                      + "*",
                    ]
                  + allowed_methods              = [
                      + "GET",
                      + "POST",
                      + "PUT",
                      + "DELETE",
                      + "OPTIONS",
                      + "PATCH",
                    ]
                  + allowed_origins              = [
                      + "*",
                    ]
                  + exposed_headers              = [
                      + "*",
                    ]
                  + is_allow_credentials_enabled = true
                  + max_age_in_seconds           = 3600
                }
            }
          + routes {
              + methods = [
                  + "GET",
                ]
              + path    = "/health"

              + backend {
                  + allowed_post_logout_uris   = (known after apply)
                  + body                       = (known after apply)
                  + connect_timeout_in_seconds = (known after apply)
                  + function_id                = (known after apply)
                  + is_ssl_verify_disabled     = (known after apply)
                  + post_logout_state          = (known after apply)
                  + read_timeout_in_seconds    = (known after apply)
                  + send_timeout_in_seconds    = (known after apply)
                  + status                     = (known after apply)
                  + type                       = "HTTP_BACKEND"
                  + url                        = "https://example.com/health"
                }

              + request_policies {}

              + response_policies {}
            }
        }
    }

  # oci_database_autonomous_database.trade_journal_db will be created
  + resource "oci_database_autonomous_database" "trade_journal_db" {
      + actual_used_data_storage_size_in_tbs           = (known after apply)
      + admin_password                                 = (sensitive value)
      + allocated_storage_size_in_tbs                  = (known after apply)
      + apex_details                                   = (known after apply)
      + are_primary_whitelisted_ips_used               = (known after apply)
      + auto_refresh_frequency_in_seconds              = (known after apply)
      + auto_refresh_point_lag_in_seconds              = (known after apply)
      + autonomous_container_database_id               = (known after apply)
      + autonomous_database_backup_id                  = (known after apply)
      + autonomous_database_id                         = (known after apply)
      + autonomous_maintenance_schedule_type           = (known after apply)
      + available_upgrade_versions                     = (known after apply)
      + backup_config                                  = (known after apply)
      + backup_retention_period_in_days                = (known after apply)
      + character_set                                  = (known after apply)
      + clone_type                                     = (known after apply)
      + compartment_id                                 = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + compute_count                                  = (known after apply)
      + compute_model                                  = (known after apply)
      + connection_strings                             = (known after apply)
      + connection_urls                                = (known after apply)
      + cpu_core_count                                 = 1
      + data_safe_status                               = (known after apply)
      + data_storage_size_in_gb                        = (known after apply)
      + data_storage_size_in_tbs                       = 1
      + database_edition                               = (known after apply)
      + database_management_status                     = (known after apply)
      + dataguard_region_type                          = (known after apply)
      + db_name                                        = "TRADEJRNL"
      + db_version                                     = (known after apply)
      + db_workload                                    = "OLTP"
      + defined_tags                                   = (known after apply)
      + disaster_recovery_region_type                  = (known after apply)
      + disaster_recovery_type                         = (known after apply)
      + display_name                                   = "trade-journal-db"
      + failed_data_recovery_in_seconds                = (known after apply)
      + freeform_tags                                  = (known after apply)
      + id                                             = (known after apply)
      + in_memory_area_in_gbs                          = (known after apply)
      + in_memory_percentage                           = (known after apply)
      + infrastructure_type                            = (known after apply)
      + is_access_control_enabled                      = (known after apply)
      + is_auto_scaling_enabled                        = false
      + is_auto_scaling_for_storage_enabled            = false
      + is_data_guard_enabled                          = (known after apply)
      + is_dedicated                                   = (known after apply)
      + is_dev_tier                                    = (known after apply)
      + is_free_tier                                   = true
      + is_local_data_guard_enabled                    = (known after apply)
      + is_mtls_connection_required                    = false
      + is_preview                                     = (known after apply)
      + is_preview_version_with_service_terms_accepted = (known after apply)
      + is_reconnect_clone_enabled                     = (known after apply)
      + is_refreshable_clone                           = (known after apply)
      + is_remote_data_guard_enabled                   = (known after apply)
      + is_replicate_automatic_backups                 = (known after apply)
      + key_history_entry                              = (known after apply)
      + key_store_id                                   = (known after apply)
      + key_store_wallet_name                          = (known after apply)
      + kms_key_id                                     = (known after apply)
      + kms_key_lifecycle_details                      = (known after apply)
      + kms_key_version_id                             = (known after apply)
      + license_model                                  = "LICENSE_INCLUDED"
      + lifecycle_details                              = (known after apply)
      + local_adg_auto_failover_max_data_loss_limit    = (known after apply)
      + local_disaster_recovery_type                   = (known after apply)
      + local_standby_db                               = (known after apply)
      + max_cpu_core_count                             = (known after apply)
      + memory_per_oracle_compute_unit_in_gbs          = (known after apply)
      + ncharacter_set                                 = (known after apply)
      + net_services_architecture                      = (known after apply)
      + next_long_term_backup_time_stamp               = (known after apply)
      + nsg_ids                                        = (known after apply)
      + ocpu_count                                     = (known after apply)
      + open_mode                                      = (known after apply)
      + operations_insights_status                     = (known after apply)
      + peer_db_ids                                    = (known after apply)
      + permission_level                               = (known after apply)
      + private_endpoint                               = (known after apply)
      + private_endpoint_ip                            = (known after apply)
      + private_endpoint_label                         = (known after apply)
      + provisionable_cpus                             = (known after apply)
      + public_connection_urls                         = (known after apply)
      + public_endpoint                                = (known after apply)
      + refreshable_mode                               = (known after apply)
      + refreshable_status                             = (known after apply)
      + remote_disaster_recovery_configuration         = (known after apply)
      + remote_disaster_recovery_type                  = (known after apply)
      + resource_pool_leader_id                        = (known after apply)
      + role                                           = (known after apply)
      + secret_id                                      = (known after apply)
      + secret_version_number                          = (known after apply)
      + service_console_url                            = (known after apply)
      + shrink_adb_trigger                             = (known after apply)
      + source                                         = (known after apply)
      + source_id                                      = (known after apply)
      + standby_db                                     = (known after apply)
      + standby_whitelisted_ips                        = (known after apply)
      + state                                          = (known after apply)
      + subnet_id                                      = (known after apply)
      + supported_regions_to_clone_to                  = (known after apply)
      + system_tags                                    = (known after apply)
      + time_created                                   = (known after apply)
      + time_data_guard_role_changed                   = (known after apply)
      + time_deletion_of_free_autonomous_database      = (known after apply)
      + time_disaster_recovery_role_changed            = (known after apply)
      + time_local_data_guard_enabled                  = (known after apply)
      + time_maintenance_begin                         = (known after apply)
      + time_maintenance_end                           = (known after apply)
      + time_of_auto_refresh_start                     = (known after apply)
      + time_of_joining_resource_pool                  = (known after apply)
      + time_of_last_failover                          = (known after apply)
      + time_of_last_refresh                           = (known after apply)
      + time_of_last_refresh_point                     = (known after apply)
      + time_of_last_switchover                        = (known after apply)
      + time_of_next_refresh                           = (known after apply)
      + time_reclamation_of_free_autonomous_database   = (known after apply)
      + time_until_reconnect_clone_enabled             = (known after apply)
      + timestamp                                      = (known after apply)
      + total_backup_storage_size_in_gbs               = (known after apply)
      + use_latest_available_backup_time_stamp         = (known after apply)
      + used_data_storage_size_in_gbs                  = (known after apply)
      + used_data_storage_size_in_tbs                  = (known after apply)
      + vault_id                                       = (known after apply)
      + whitelisted_ips                                = [
          + "0.0.0.0/0",
        ]
    }

  # oci_functions_application.trade_journal_app will be created
  + resource "oci_functions_application" "trade_journal_app" {
      + compartment_id             = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + config                     = (known after apply)
      + defined_tags               = (known after apply)
      + display_name               = "trade-journal"
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + network_security_group_ids = (known after apply)
      + shape                      = (known after apply)
      + state                      = (known after apply)
      + subnet_ids                 = [
          + "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaady665tq6nw3ikw43my6ylw6y7gck733zlbpsoodm7ereqltdryma",
        ]
      + syslog_url                 = (known after apply)
      + time_created               = (known after apply)
      + time_updated               = (known after apply)

      + trace_config {
          + domain_id  = (known after apply)
          + is_enabled = true
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + autonomous_database_id     = (known after apply)
  + database_connection_string = (sensitive value)
  + functions_application_id   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Maddy1993, Action: `pull_request`, Workflow: `Deploy OCI Infrastructure`*